In [1]:
range(0,1,0.1)

TypeError: range() integer step argument expected, got float.

In [2]:
l=[[1,2,3,4],[5,6,7,8],[9,10,11]]
max(l)

[9, 10, 11]

In [3]:
sum(l)

TypeError: unsupported operand type(s) for +: 'int' and 'list'

In [4]:
min(l)

[1, 2, 3, 4]

In [5]:
l=[{'name':'n1','sal':123},{'name':'n2','sal':34}]

In [6]:
import pandas as pd

In [7]:
data=pd.read_csv('data.csv',sk)

In [8]:
print type(data)

<class 'pandas.core.frame.DataFrame'>

In [9]:
data.columns

Index([u'Unnamed: 0', u'Unnamed: 1', u'Unnamed: 2', u'Unnamed: 3'], dtype='object')

In [11]:
data=pd.read_csv('data.csv',skiprows=2)

In [12]:
data.columns

Index([u'id', u'name', u'salary', u'address'], dtype='object')

In [13]:
data.salary

0       1234
1       4567
2       8910
3     111213
4       1235
5       4568
6       8911
7     111214
8       1236
9       4569
10      8912
11    111215
12      1237
13      4570
14      8913
15    111216
16      1238
17      4571
18      8914
19    111217
20      1239
21      4572
22      8915
23    111218
24      1240
25      4573
26      8916
27    111219
28      1241
29      4574
30      8917
Name: salary, dtype: int64

In [14]:
data.salary.sum()

896284

In [15]:
data.salary.mean()

28912.387096774193

In [16]:
data.salary.min()

1234

In [17]:
data[data['salary']>4567]

    id    name  salary address
2    3   name3    8910     ad1
3    4   name4  111213     ad2
5    6   name6    4568     ad3
6    7   name7    8911     ad2
7    8   name8  111214     ad3
9   10  name10    4569     ad4
10  11  name11    8912     ad3
11  12  name12  111215     ad4
13  14  name14    4570     ad5
14  15  name15    8913     ad4
15  16  name16  111216     ad5
17  18  name18    4571     ad6
18  19  name19    8914     ad5
19  20  name20  111217     ad6
21  22  name22    4572     ad7
22  23  name23    8915     ad6
23  24  name24  111218     ad7
25  26  name26    4573     ad8
26  27  name27    8916     ad7
27  28  name28  111219     ad8
29  30  name30    4574     ad9
30  31  name31    8917     ad8

In [20]:
data = pd.read_clipboard()

In [21]:
data

    id    name  salary address
0    1   name1    1234     ad1
1    2   name2    4567     ad2
2    3   name3    8910     ad1
3    4   name4  111213     ad2
4    5   name5    1235     ad2
5    6   name6    4568     ad3
6    7   name7    8911     ad2
7    8   name8  111214     ad3
8    9   name9    1236     ad3
9   10  name10    4569     ad4
10  11  name11    8912     ad3
11  12  name12  111215     ad4
12  13  name13    1237     ad4

In [22]:
import sqlite3
con  = sqlite3.connect('db1.db')
data = pd.read_sql('select * from persons',con)

In [23]:
data

   id   name
0   1  name1

In [24]:
data=pd.read_csv('data.csv',skiprows=2)

In [25]:
from matplotlib import pyplot as plt

In [26]:
data.head()

   id   name  salary address
0   1  name1    1234     ad1
1   2  name2    4567     ad2
2   3  name3    8910     ad1
3   4  name4  111213     ad2
4   5  name5    1235     ad2

In [27]:
data.plot(kind='bar')
plt.show()

In [30]:
data.plot(kind='bar',x='name',y="salary")
plt.show()